{
  "version": 3,
  "languages": {
    "en": {
      "sections": [
        { "kind": "title", "text": "Overview" },
        {
          "kind": "paragraph",
          "text": "This guide explains what you can do in each main section of the app, how the features work together, and how to manage your invoices, payments, devices, and subscriptions safely."
        },

        { "kind": "spacer", "size": 24 },

        { "kind": "section_title", "text": "Invoices" },
        {
          "kind": "bullets",
          "items": [
            "Create invoices for your clients with services and products.",
            "Add items with quantity, price, and optional tax.",
            "Change the status of an invoice (draft, sent, paid).",
            "Filter invoices by status, date range, product, or search by client and notes.",
            "Duplicate existing invoices to quickly reuse the same structure.",
            "Generate professional PDF invoices with your logo, business information, and legal footer."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Clients" },
        {
          "kind": "bullets",
          "items": [
            "Store your clients with name, contact details, and notes.",
            "Quickly select a client when creating a new invoice.",
            "Keep your client list organized and mark clients as inactive when needed."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Products & Services" },
        {
          "kind": "bullets",
          "items": [
            "Create products or services that you frequently use.",
            "Define a default price and tax rate for each item.",
            "Select items from your catalog when adding them to an invoice."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Payments" },
        {
          "kind": "bullets",
          "items": [
            "View detailed information about each payment made in the app.",
            "Check payment status, amount, plan, and customer email.",
            "Access payment history linked to your invoices and licenses.",
            "Retry a payment in testing mode if something did not complete correctly.",
            "Cancel a subscription payment directly from the payment detail screen if a customer gets stuck (when available)."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Plans, subscriptions & licenses" },
        {
          "kind": "bullets",
          "items": [
            "Start with a 7-day free trial and upgrade only if the app fits your workflow.",
            "Subscriptions are billed yearly and renew automatically unless you cancel.",
            "You can cancel anytime from the app and you will keep access until your current paid period ends.",
            "Your license is linked to your email and enforces a device limit depending on your plan.",
            "If you try to buy the same plan you already have active, the app will inform you that the plan is already active."
          ]
        },

        { "kind": "spacer", "size": 10 },

        { "kind": "section_title", "text": "Switching plans (important)" },
        {
          "kind": "bullets",
          "items": [
            "If you already have an active subscription and you select a different plan, the app will ask you to confirm switching plans.",
            "When switching plans, the new plan is charged 100% (full yearly price). There are no refunds for unused time on the previous plan.",
            "Your current subscription is not cancelled before the new checkout completes, so you do not lose access if you abandon the new checkout.",
            "After the new subscription becomes active, the system can cancel/replace the previous subscription depending on your configuration."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Linked devices" },
        {
          "kind": "bullets",
          "items": [
            "See which devices are currently using your license.",
            "If your plan allows more than one device, you can use the app on multiple devices within the allowed limit.",
            "If you reach the device limit, you may need to remove an old device before linking a new one."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Settings" },
        {
          "kind": "bullets_with_subtitles",
          "blocks": [
            {
              "title": "Business information",
              "description": "Configure your logo, business name, contact details, website, and legal footer shown on invoices and PDFs."
            },
            {
              "title": "App preferences",
              "description": "Customize theme, language, currency, and date format to match your preferences."
            },
            {
              "title": "Plans & subscriptions",
              "description": "View plans, pricing, subscription status, and manage upgrades or cancellations."
            },
            {
              "title": "Taxes & finance",
              "description": "Define default tax values and how taxes appear in invoice totals."
            },
            {
              "title": "Reminders",
              "description": "Set default due dates and reminders to follow up on unpaid invoices."
            },
            {
              "title": "Security",
              "description": "Protect the app with PIN or biometric access and keep your data secure on your device."
            },
            {
              "title": "Linked devices",
              "description": "View and manage devices using this license."
            },
            {
              "title": "Backup & export",
              "description": "Create backups of your data and restore them on another device if needed."
            },
            {
              "title": "Updates",
              "description": "Check your current version, see what’s new, and open the official download page."
            }
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Tips & best practices" },
        {
          "kind": "bullets",
          "items": [
            "Set up your business profile before creating invoices for a professional look.",
            "Add your most common products and services to save time.",
            "Review payments and subscription status regularly to stay in control.",
            "Use backups often, especially before switching devices.",
            "If you are switching plans, confirm the change when prompted to continue the checkout flow."
          ]
        },

        { "kind": "spacer", "size": 24 },

        {
          "kind": "paragraph_small",
          "text": "If you are unsure what a section does, open it and explore calmly. You can always return to this guide from Settings → Help & guide."
        }
      ]
    },

    "es": {
      "sections": [
        { "kind": "title", "text": "Resumen general" },
        {
          "kind": "paragraph",
          "text": "Esta guía explica qué puedes hacer en cada sección principal de la app, cómo se relacionan las funciones y cómo gestionar facturas, pagos, dispositivos y suscripciones de forma segura."
        },

        { "kind": "spacer", "size": 24 },

        { "kind": "section_title", "text": "Facturas" },
        {
          "kind": "bullets",
          "items": [
            "Crear facturas para tus clientes con servicios y productos.",
            "Añadir ítems con cantidad, precio e impuesto opcional.",
            "Cambiar el estado de la factura (borrador, enviada, pagada).",
            "Filtrar facturas por estado, rango de fechas, producto o buscar por cliente y notas.",
            "Duplicar facturas existentes para reutilizar la misma estructura.",
            "Generar facturas en PDF profesionales con tu logo, datos del negocio y pie legal."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Clientes" },
        {
          "kind": "bullets",
          "items": [
            "Guardar clientes con nombre, datos de contacto y notas.",
            "Seleccionar rápidamente un cliente al crear una nueva factura.",
            "Mantener la lista organizada y marcar clientes como inactivos si es necesario."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Productos y servicios" },
        {
          "kind": "bullets",
          "items": [
            "Crear productos o servicios que usas con frecuencia.",
            "Definir un precio e impuesto por defecto para cada ítem.",
            "Seleccionar ítems del catálogo al agregarlos a una factura."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Pagos" },
        {
          "kind": "bullets",
          "items": [
            "Ver información detallada de cada pago realizado.",
            "Revisar estado del pago, monto, plan y email del cliente.",
            "Acceder al historial de pagos vinculado a facturas y licencias.",
            "Reintentar un pago en modo testing si no se completó correctamente.",
            "Cancelar un pago de suscripción desde el detalle del pago si el cliente queda atascado (cuando aplique)."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Planes, suscripciones y licencias" },
        {
          "kind": "bullets",
          "items": [
            "Comienza con un trial gratis de 7 días y actualiza solo si la app encaja con tu trabajo.",
            "Las suscripciones se cobran anual y se renuevan automáticamente si no cancelas.",
            "Puedes cancelar en cualquier momento desde la app y mantendrás acceso hasta que termine el período pagado.",
            "La licencia se vincula a tu email y limita la cantidad de dispositivos según el plan.",
            "Si intentas comprar el mismo plan que ya tienes activo, la app te avisará que ese plan ya está activo."
          ]
        },

        { "kind": "spacer", "size": 10 },

        { "kind": "section_title", "text": "Cambio de plan (importante)" },
        {
          "kind": "bullets",
          "items": [
            "Si ya tienes una suscripción activa y eliges otro plan distinto, la app te pedirá confirmar el cambio de plan.",
            "Al cambiar de plan, el nuevo plan se cobra al 100% (precio anual completo). No hay reembolso del tiempo no usado del plan anterior.",
            "El sistema no cancela el plan anterior antes de que completes el nuevo checkout, para que no pierdas acceso si abandonas el proceso.",
            "Después de que el nuevo plan quede activo, el sistema puede cancelar/reemplazar el plan anterior según la configuración."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Dispositivos vinculados" },
        {
          "kind": "bullets",
          "items": [
            "Ver qué dispositivos están usando tu licencia actualmente.",
            "Si tu plan permite más de un dispositivo, puedes usar la app en varios dentro del límite permitido.",
            "Si llegas al límite de dispositivos, puede que tengas que eliminar un dispositivo antiguo antes de vincular uno nuevo."
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Ajustes" },
        {
          "kind": "bullets_with_subtitles",
          "blocks": [
            {
              "title": "Información del negocio",
              "description": "Configura tu logo, nombre del negocio, contacto, web y pie legal que aparecen en facturas y PDFs."
            },
            {
              "title": "Preferencias de la app",
              "description": "Personaliza tema, idioma, moneda y formato de fecha."
            },
            {
              "title": "Planes y suscripciones",
              "description": "Ver planes, precios, estado de suscripción y administrar mejoras o cancelaciones."
            },
            {
              "title": "Impuestos y finanzas",
              "description": "Define impuestos por defecto y cómo aparecen en los totales."
            },
            {
              "title": "Recordatorios",
              "description": "Configura vencimientos y recordatorios para facturas sin pagar."
            },
            {
              "title": "Seguridad",
              "description": "Protege la app con PIN o biometría y mantiene tus datos seguros."
            },
            {
              "title": "Dispositivos vinculados",
              "description": "Ver y gestionar los dispositivos que usan esta licencia."
            },
            {
              "title": "Copia y exportación",
              "description": "Crear copias de tus datos y restaurarlas en otro dispositivo si lo necesitas."
            },
            {
              "title": "Actualizaciones",
              "description": "Ver tu versión, novedades y abrir la página oficial de descargas."
            }
          ]
        },

        { "kind": "spacer", "size": 16 },

        { "kind": "section_title", "text": "Consejos y buenas prácticas" },
        {
          "kind": "bullets",
          "items": [
            "Configura tu perfil de negocio antes de crear facturas para que se vean profesionales.",
            "Agrega tus productos y servicios más comunes para ahorrar tiempo.",
            "Revisa pagos y estado de suscripción con frecuencia para mantener el control.",
            "Haz copias de seguridad seguido, especialmente antes de cambiar de dispositivo.",
            "Si vas a cambiar de plan, confirma el cambio cuando la app te lo pida para continuar el checkout."
          ]
        },

        { "kind": "spacer", "size": 24 },

        {
          "kind": "paragraph_small",
          "text": "Si no estás segura de qué hace una sección, ábrela y explora con calma. Siempre puedes volver a esta guía desde Ajustes → Ayuda y guía."
        }
      ]
    }
  }
}
